In [1]:
import numpy as np
import pandas as pd

In [5]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [6]:
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(thresh=2)#row 1 will ot be dropped as it has at least 2 non NA values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [15]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [16]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64